$(function() {
    "use strict";

    // 用户收视时间分布
    var $timeTable = $("#time-table");

    $timeTable.dataTable({
        "info" : false,
        "paging": true,
        "filter": false,
        "lengthChange": false,
        "pageLength":8,
        "destroy": true,
        "columns": [
            { "title": "日期", "class": "center" },
            { "title": "直播",  "class": "center" },
            { "title": "点播",  "class": "center" },
            { "title": "回看",  "class": "center" }
        ],
        "data": [
            ["11/01/14", 3.4, 0.7, 0.2],
            ["11/02/14", 3.2, 0.6, 0.3],
            ["11/03/14", 3.7, 0.9, 0.4],
            ["11/04/14", 4.0, 0.8, 0.4],
            ["11/05/14", 3.3, 0.9, 0.3],
            ["11/06/14", 3.7, 0.5, 0.1],
            ["11/07/14", 3.9, 0.8, 0.2],
            ["11/08/14", 3.9, 0.8, 0.1],
            ["11/09/14", 3.7, 0.9, 0.1],
            ["11/10/14", 3.9, 0.9, 0.4],
            ["11/11/14", 3.1, 0.9, 0.5],
            ["11/12/14", 3.7, 0.6, 0.3],
            ["11/13/14", 3.7, 0.5, 0.4],
            ["11/14/14", 3.6, 0.6, 0.3],
            ["11/15/14", 3.6, 0.9, 0.2],
            ["11/16/14", 4.0, 1.0, 0.5],
            ["11/17/14", 3.3, 1.0, 0.3],
            ["11/18/14", 3.8, 0.7, 0.5],
            ["11/19/14", 3.1, 0.8, 0.3],
            ["11/20/14", 3.1, 0.9, 0.4],
            ["11/21/14", 3.8, 0.7, 0.2],
            ["11/22/14", 3.4, 0.6, 0.2],
            ["11/23/14", 3.4, 0.5, 0.4],
            ["11/24/14", 3.1, 0.9, 0.3],
            ["11/25/14", 3.5, 0.8, 0.3],
            ["11/26/14", 4.0, 0.9, 0.5],
            ["11/27/14", 3.4, 0.8, 0.4],
            ["11/28/14", 3.1, 0.6, 0.2],
            ["11/29/14", 3.5, 0.7, 0.4],
            ["11/30/14", 3.5, 0.6, 0.4]
        ]
    });


   // 用户收视时间分布
    var $timeChartDom = document.getElementById('time-chart-pane');
    var $timeChart = echarts.init($timeChartDom);
    var timeOption = {
        tooltip : {
            trigger: 'item',
            formatter: "{b} <br/>收看时间 : {c} 小时 <br/>时间占比 : {d} %"
        },
        legend: {
            orient : 'vertical',
            x : 'left',
            data:['电视剧','综艺','新闻','体育','电影','本地生活','访谈','教育', '广告']
        },
        toolbox: {
            show : false
        },
        calculable : false,
        series : [
            {
                name:'收看时间',
                type:'pie',
                radius : [30, 160],
                roseType : 'radius',
                selectedMode: 'single',
                x: '50%',               // for funnel
                max: 40,                // for funnel
                sort : 'ascending',     // for funnel
                data:[
                    {value: 2.4, name:'电视剧'},
                    {value: 2.6, name:'综艺'},
                    {value: 0.4, name:'新闻'},
                    {value: 0.6, name:'体育'},
                    {value: 0.7, name:'电影'},
                    {value: 0.2, name:'本地生活'},
                    {value: 0.6, name:'访谈'},
                    {value: 0.1, name:'教育'},
                    {value: 1.3, name:'广告'}
                ]
            }
        ]
    };

    $timeChart.setOption(timeOption);

    // 广告时长与切换率
    var $switchAllChart = $('#switch-all-chart');

    $switchAllChart.highcharts({
        chart: {
            type: 'column'
        },
        title: {
            text: '广告时长与切换率'
        },
        subtitle: {
            text: '2014年11月'
        },
        xAxis: {
            type: 'category',
            labels: {
                rotation: -45,
                style: {
                    fontSize: '14px',
                    fontFamily: 'Verdana, sans-serif'
                }
            }
        },
        yAxis: {
            min: 0,
            max: 70,
            title: {
                text: '切换率（%）'
            }
        },
        tooltip: {
            pointFormat: '{series.name}: <b>{point.y} %</b>'
        },
        series: [{
            name: '新闻节目后贴片',
            data: [
                ['0 ~ 15 秒钟' , 6.7 ],
                ['15 ~ 30 秒钟', 9.1 ],
                ['0.5 ~ 1 分钟', 14.2],
                ['1 ~ 2 分钟'  , 28.0],
                ['2 ~ 3 分钟'  , 32.5],
                ['3 ~ 4 分钟'  , 39.1],
                ['4 ~ 5 分钟'  , 41.8],
                ['5 ~ 6 分钟'  , 46.8],
                ['6 ~ 7 分钟'  , 51.8],
                ['7 ~ 8 分钟'  , 56.8],
                ['8 ~ 9 分钟'  , 63.8],
                ['9 ~ 10 分钟' , 68.8],
                ['10 分钟以上'  , 71.7]
            ]
        },{
            name: '电视剧后贴片',
            data: [
                ['0 ~ 15 秒钟' , 5.7 ],
                ['15 ~ 30 秒钟', 6.1 ],
                ['0.5 ~ 1 分钟', 12.2],
                ['1 ~ 2 分钟'  , 27.0],
                ['2 ~ 3 分钟'  , 31.5],
                ['3 ~ 4 分钟'  , 34.1],
                ['4 ~ 5 分钟'  , 40.8],
                ['5 ~ 6 分钟'  , 43.8],
                ['6 ~ 7 分钟'  , 49.8],
                ['7 ~ 8 分钟'  , 52.8],
                ['8 ~ 9 分钟'  , 60.8],
                ['9 ~ 10 分钟' , 69.8],
                ['10 分钟以上'  , 69.7]
            ]
        }, {
            name: '综艺节目后贴片',
            data: [
                ['0 ~ 15 秒钟' , 8.7 ],
                ['15 ~ 30 秒钟', 12.1 ],
                ['0.5 ~ 1 分钟', 16.2],
                ['1 ~ 2 分钟'  , 24.0],
                ['2 ~ 3 分钟'  , 36.5],
                ['3 ~ 4 分钟'  , 33.1],
                ['4 ~ 5 分钟'  , 45.8],
                ['5 ~ 6 分钟'  , 49.8],
                ['6 ~ 7 分钟'  , 56.8],
                ['7 ~ 8 分钟'  , 58.8],
                ['8 ~ 9 分钟'  , 60.8],
                ['9 ~ 10 分钟' , 64.8],
                ['10 分钟以上'  , 76.7]
            ]
        },{
            name: '生活节目后贴片',
            data: [
                ['0 ~ 15 秒钟' , 3.7 ],
                ['15 ~ 30 秒钟', 5.1 ],
                ['0.5 ~ 1 分钟', 8.2],
                ['1 ~ 2 分钟'  , 15.0],
                ['2 ~ 3 分钟'  , 22.5],
                ['3 ~ 4 分钟'  , 29.1],
                ['4 ~ 5 分钟'  , 34.8],
                ['5 ~ 6 分钟'  , 39.8],
                ['6 ~ 7 分钟'  , 45.8],
                ['7 ~ 8 分钟'  , 48.8],
                ['8 ~ 9 分钟'  , 53.8],
                ['9 ~ 10 分钟' , 58.8],
                ['10 分钟以上'  , 67.7]
            ]
        }]
    });

    window.onresize = function() {
        $timeChart.resize();
    };

});